# # language: ru
# Функция: Слияние заметок
#   Сценарий: Создание новой заметки
#     Пусть смотрим на активную вкладку
#     Когда нажимаем на кнопку "Новая заметка"
#     И смотрим на подсказку
#     И ждём 1 секунду
#     И вводим "Ералаш"
#     И нажимаем на клавишу "Enter"
#     И вводим "Мальчишки и девчонки, парам пам пам, а так же их родители, парам пам пам. Веселую историю, парам пам пам. Услышать не хотители? Веселую историю, в журнале Ералаш."
#     Тогда видим текст "Мальчишки и девчонки, парам пам пам, а так же их родители, парам пам пам. Веселую историю, парам пам пам. Услышать не хотители? Веселую историю, в журнале Ералаш."
#   Сценарий: Слияние заметок
#     Пусть смотрим на активную вкладку
#     Когда перетаскиваем "Ералаш" над "Жить здорово с Еленой Малышевой"
#     И ждём 1 секунду
#     И нажимаем на кнопку "Жить здорово с Еленой Малышевой"
#     И смотрим на подсказку
#     И ждём 1 секунду
#     Тогда видим текст "Мальчишки и девчонки, парам пам пам, а так же их родители, парам пам пам. Веселую историю, парам пам пам. Услышать не хотители? Веселую историю, в журнале Ералаш."
