# language: ru
Функция: Дискард одного файла

  # Сценарий: Открытие окна публикации
  #   Пусть смотрим на "левую панель"
  #   И смотрим на "нижнюю панель"
  #   Когда нажимаем на иконку "облачка"
  #   Тогда видим форму "публикация" без заголовка

  # Сценарий: Дискард одного файла
  #   Пусть смотрим на активную форму
  #   Когда смотрим на "левую панель"
  #   И смотрим на "new-article.md"
  #   И наводим мышку
  #   И нажимаем на иконку "отмена"
  #   Тогда файл "new-article.md" не существует
